# Решение через list
list = ['зима','зима','весна','весна','весна','лето','лето','лето','осень','осень','осень','зима']
month = input("Введите номер месяца ")
month = int(month)
if (month <= 12):
	i = 0
	while i < 12:
		if (month == i + 1):
			res1 = list[i]
			break
		i = i + 1
	print(f"Решение через list: {res1}")

	# Решение через dict
	dict = {"1":"зима","2":"зима","3":"весна","4":"весна","5":"весна","6":"лето",
	"7":"лето","8":"лето","9":"осень","10":"осень","11":"осень","12":"зима"}
	res2 = dict[str(month)]
	print(f"Решение через dict: {res2}")
else:
	print("Такого месяца несуществует")
